Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_rolo_pic32_cm_mc/firmware/src/packs/PIC32CM1216MC00048_DFP/component/tsens.h
/**
 * \brief Component description for TSENS
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-08-03T13:06:13Z */
#ifndef _PIC32CMMC00_TSENS_COMPONENT_H_
#define _PIC32CMMC00_TSENS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TSENS                                        */
/* ************************************************************************** */

/* -------- TSENS_CTRLA : (TSENS Offset: 0x00) (R/W 8) Control A Register -------- */
#define TSENS_CTRLA_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_CTRLA) Control A Register  Reset Value */

#define TSENS_CTRLA_SWRST_Pos                 _U_(0)                                               /**< (TSENS_CTRLA) Software Reset Position */
#define TSENS_CTRLA_SWRST_Msk                 (_U_(0x1) << TSENS_CTRLA_SWRST_Pos)                  /**< (TSENS_CTRLA) Software Reset Mask */
#define TSENS_CTRLA_SWRST(value)              (TSENS_CTRLA_SWRST_Msk & ((value) << TSENS_CTRLA_SWRST_Pos))
#define TSENS_CTRLA_ENABLE_Pos                _U_(1)                                               /**< (TSENS_CTRLA) Enable Position */
#define TSENS_CTRLA_ENABLE_Msk                (_U_(0x1) << TSENS_CTRLA_ENABLE_Pos)                 /**< (TSENS_CTRLA) Enable Mask */
#define TSENS_CTRLA_ENABLE(value)             (TSENS_CTRLA_ENABLE_Msk & ((value) << TSENS_CTRLA_ENABLE_Pos))
#define TSENS_CTRLA_RUNSTDBY_Pos              _U_(6)                                               /**< (TSENS_CTRLA) Run in Standby Position */
#define TSENS_CTRLA_RUNSTDBY_Msk              (_U_(0x1) << TSENS_CTRLA_RUNSTDBY_Pos)               /**< (TSENS_CTRLA) Run in Standby Mask */
#define TSENS_CTRLA_RUNSTDBY(value)           (TSENS_CTRLA_RUNSTDBY_Msk & ((value) << TSENS_CTRLA_RUNSTDBY_Pos))
#define TSENS_CTRLA_Msk                       _U_(0x43)                                            /**< (TSENS_CTRLA) Register Mask  */


/* -------- TSENS_CTRLB : (TSENS Offset: 0x01) ( /W 8) Control B Register -------- */
#define TSENS_CTRLB_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_CTRLB) Control B Register  Reset Value */

#define TSENS_CTRLB_START_Pos                 _U_(0)                                               /**< (TSENS_CTRLB) Start Measurement Position */
#define TSENS_CTRLB_START_Msk                 (_U_(0x1) << TSENS_CTRLB_START_Pos)                  /**< (TSENS_CTRLB) Start Measurement Mask */
#define TSENS_CTRLB_START(value)              (TSENS_CTRLB_START_Msk & ((value) << TSENS_CTRLB_START_Pos))
#define TSENS_CTRLB_Msk                       _U_(0x01)                                            /**< (TSENS_CTRLB) Register Mask  */


/* -------- TSENS_CTRLC : (TSENS Offset: 0x02) (R/W 8) Control C Register -------- */
#define TSENS_CTRLC_RESETVALUE                _U_(0x00)                                            /**<  (TSENS_CTRLC) Control C Register  Reset Value */

#define TSENS_CTRLC_WINMODE_Pos               _U_(0)                                               /**< (TSENS_CTRLC) Window Monitor Mode Position */
#define TSENS_CTRLC_WINMODE_Msk               (_U_(0x7) << TSENS_CTRLC_WINMODE_Pos)                /**< (TSENS_CTRLC) Window Monitor Mode Mask */
#define TSENS_CTRLC_WINMODE(value)            (TSENS_CTRLC_WINMODE_Msk & ((value) << TSENS_CTRLC_WINMODE_Pos))
#define   TSENS_CTRLC_WINMODE_DISABLE_Val     _U_(0x0)                                             /**< (TSENS_CTRLC) No window mode (default)  */
#define   TSENS_CTRLC_WINMODE_ABOVE_Val       _U_(0x1)                                             /**< (TSENS_CTRLC) VALUE greater than WINLT  */
#define   TSENS_CTRLC_WINMODE_BELOW_Val       _U_(0x2)                                             /**< (TSENS_CTRLC) VALUE less than WINUT  */
#define   TSENS_CTRLC_WINMODE_INSIDE_Val      _U_(0x3)                                             /**< (TSENS_CTRLC) VALUE greater than WINLT and VALUE less than WINUT  */
#define   TSENS_CTRLC_WINMODE_OUTSIDE_Val     _U_(0x4)                                             /**< (TSENS_CTRLC) VALUE less than WINLT or VALUE greater than WINUT  */
#define   TSENS_CTRLC_WINMODE_HYST_ABOVE_Val  _U_(0x5)                                             /**< (TSENS_CTRLC) VALUE greater than WINUT with hysteresis to WINLT  */
#define   TSENS_CTRLC_WINMODE_HYST_BELOW_Val  _U_(0x6)                                             /**< (TSENS_CTRLC) VALUE less than WINLST with hysteresis to WINUT  */
#define TSENS_CTRLC_WINMODE_DISABLE           (TSENS_CTRLC_WINMODE_DISABLE_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) No window mode (default) Position  */
#define TSENS_CTRLC_WINMODE_ABOVE             (TSENS_CTRLC_WINMODE_ABOVE_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE greater than WINLT Position  */
#define TSENS_CTRLC_WINMODE_BELOW             (TSENS_CTRLC_WINMODE_BELOW_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE less than WINUT Position  */
#define TSENS_CTRLC_WINMODE_INSIDE            (TSENS_CTRLC_WINMODE_INSIDE_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE greater than WINLT and VALUE less than WINUT Position  */
#define TSENS_CTRLC_WINMODE_OUTSIDE           (TSENS_CTRLC_WINMODE_OUTSIDE_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE less than WINLT or VALUE greater than WINUT Position  */
#define TSENS_CTRLC_WINMODE_HYST_ABOVE        (TSENS_CTRLC_WINMODE_HYST_ABOVE_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE greater than WINUT with hysteresis to WINLT Position  */
#define TSENS_CTRLC_WINMODE_HYST_BELOW        (TSENS_CTRLC_WINMODE_HYST_BELOW_Val << TSENS_CTRLC_WINMODE_Pos) /**< (TSENS_CTRLC) VALUE less than WINLST with hysteresis to WINUT Position  */
#define TSENS_CTRLC_FREERUN_Pos               _U_(4)                                               /**< (TSENS_CTRLC) Free Running Measurement Position */
#define TSENS_CTRLC_FREERUN_Msk               (_U_(0x1) << TSENS_CTRLC_FREERUN_Pos)                /**< (TSENS_CTRLC) Free Running Measurement Mask */
#define TSENS_CTRLC_FREERUN(value)            (TSENS_CTRLC_FREERUN_Msk & ((value) << TSENS_CTRLC_FREERUN_Pos))
#define TSENS_CTRLC_Msk                       _U_(0x17)                                            /**< (TSENS_CTRLC) Register Mask  */


/* -------- TSENS_EVCTRL : (TSENS Offset: 0x03) (R/W 8) Event Control Register -------- */
#define TSENS_EVCTRL_RESETVALUE               _U_(0x00)                                            /**<  (TSENS_EVCTRL) Event Control Register  Reset Value */

#define TSENS_EVCTRL_STARTEI_Pos              _U_(0)                                               /**< (TSENS_EVCTRL) Start Conversion Event Input Enable Position */
#define TSENS_EVCTRL_STARTEI_Msk              (_U_(0x1) << TSENS_EVCTRL_STARTEI_Pos)               /**< (TSENS_EVCTRL) Start Conversion Event Input Enable Mask */
#define TSENS_EVCTRL_STARTEI(value)           (TSENS_EVCTRL_STARTEI_Msk & ((value) << TSENS_EVCTRL_STARTEI_Pos))
#define TSENS_EVCTRL_STARTINV_Pos             _U_(1)                                               /**< (TSENS_EVCTRL) Start Conversion Event Invert Enable Position */
#define TSENS_EVCTRL_STARTINV_Msk             (_U_(0x1) << TSENS_EVCTRL_STARTINV_Pos)              /**< (TSENS_EVCTRL) Start Conversion Event Invert Enable Mask */
#define TSENS_EVCTRL_STARTINV(value)          (TSENS_EVCTRL_STARTINV_Msk & ((value) << TSENS_EVCTRL_STARTINV_Pos))
#define TSENS_EVCTRL_WINEO_Pos                _U_(2)                                               /**< (TSENS_EVCTRL) Window Monitor Event Out Position */
#define TSENS_EVCTRL_WINEO_Msk                (_U_(0x1) << TSENS_EVCTRL_WINEO_Pos)                 /**< (TSENS_EVCTRL) Window Monitor Event Out Mask */
#define TSENS_EVCTRL_WINEO(value)             (TSENS_EVCTRL_WINEO_Msk & ((value) << TSENS_EVCTRL_WINEO_Pos))
#define TSENS_EVCTRL_Msk                      _U_(0x07)                                            /**< (TSENS_EVCTRL) Register Mask  */


/* -------- TSENS_INTENCLR : (TSENS Offset: 0x04) (R/W 8) Interrupt Enable Clear Register -------- */
#define TSENS_INTENCLR_RESETVALUE             _U_(0x00)                                            /**<  (TSENS_INTENCLR) Interrupt Enable Clear Register  Reset Value */

#define TSENS_INTENCLR_RESRDY_Pos             _U_(0)                                               /**< (TSENS_INTENCLR) Result Ready Interrupt Enable Position */
#define TSENS_INTENCLR_RESRDY_Msk             (_U_(0x1) << TSENS_INTENCLR_RESRDY_Pos)              /**< (TSENS_INTENCLR) Result Ready Interrupt Enable Mask */
#define TSENS_INTENCLR_RESRDY(value)          (TSENS_INTENCLR_RESRDY_Msk & ((value) << TSENS_INTENCLR_RESRDY_Pos))
#define TSENS_INTENCLR_OVERRUN_Pos            _U_(1)                                               /**< (TSENS_INTENCLR) Overrun Interrupt Enable Position */
#define TSENS_INTENCLR_OVERRUN_Msk            (_U_(0x1) << TSENS_INTENCLR_OVERRUN_Pos)             /**< (TSENS_INTENCLR) Overrun Interrupt Enable Mask */
#define TSENS_INTENCLR_OVERRUN(value)         (TSENS_INTENCLR_OVERRUN_Msk & ((value) << TSENS_INTENCLR_OVERRUN_Pos))
#define TSENS_INTENCLR_WINMON_Pos             _U_(2)                                               /**< (TSENS_INTENCLR) Window Monitor Interrupt Enable Position */
#define TSENS_INTENCLR_WINMON_Msk             (_U_(0x1) << TSENS_INTENCLR_WINMON_Pos)              /**< (TSENS_INTENCLR) Window Monitor Interrupt Enable Mask */
#define TSENS_INTENCLR_WINMON(value)          (TSENS_INTENCLR_WINMON_Msk & ((value) << TSENS_INTENCLR_WINMON_Pos))
#define TSENS_INTENCLR_OVF_Pos                _U_(3)                                               /**< (TSENS_INTENCLR) Overflow Interrupt Enable Position */
#define TSENS_INTENCLR_OVF_Msk                (_U_(0x1) << TSENS_INTENCLR_OVF_Pos)                 /**< (TSENS_INTENCLR) Overflow Interrupt Enable Mask */
#define TSENS_INTENCLR_OVF(value)             (TSENS_INTENCLR_OVF_Msk & ((value) << TSENS_INTENCLR_OVF_Pos))
#define TSENS_INTENCLR_Msk                    _U_(0x0F)                                            /**< (TSENS_INTENCLR) Register Mask  */


/* -------- TSENS_INTENSET : (TSENS Offset: 0x05) (R/W 8) Interrupt Enable Set Register -------- */
#define TSENS_INTENSET_RESETVALUE             _U_(0x00)                                            /**<  (TSENS_INTENSET) Interrupt Enable Set Register  Reset Value */

#define TSENS_INTENSET_RESRDY_Pos             _U_(0)                                               /**< (TSENS_INTENSET) Result Ready Interrupt Enable Position */
#define TSENS_INTENSET_RESRDY_Msk             (_U_(0x1) << TSENS_INTENSET_RESRDY_Pos)              /**< (TSENS_INTENSET) Result Ready Interrupt Enable Mask */
#define TSENS_INTENSET_RESRDY(value)          (TSENS_INTENSET_RESRDY_Msk & ((value) << TSENS_INTENSET_RESRDY_Pos))
#define TSENS_INTENSET_OVERRUN_Pos            _U_(1)                                               /**< (TSENS_INTENSET) Overrun Interrupt Enable Position */
#define TSENS_INTENSET_OVERRUN_Msk            (_U_(0x1) << TSENS_INTENSET_OVERRUN_Pos)             /**< (TSENS_INTENSET) Overrun Interrupt Enable Mask */
#define TSENS_INTENSET_OVERRUN(value)         (TSENS_INTENSET_OVERRUN_Msk & ((value) << TSENS_INTENSET_OVERRUN_Pos))
#define TSENS_INTENSET_WINMON_Pos             _U_(2)                                               /**< (TSENS_INTENSET) Window Monitor Interrupt Enable Position */
#define TSENS_INTENSET_WINMON_Msk             (_U_(0x1) << TSENS_INTENSET_WINMON_Pos)              /**< (TSENS_INTENSET) Window Monitor Interrupt Enable Mask */
#define TSENS_INTENSET_WINMON(value)          (TSENS_INTENSET_WINMON_Msk & ((value) << TSENS_INTENSET_WINMON_Pos))
#define TSENS_INTENSET_OVF_Pos                _U_(3)                                               /**< (TSENS_INTENSET) Overflow Interrupt Enable Position */
#define TSENS_INTENSET_OVF_Msk                (_U_(0x1) << TSENS_INTENSET_OVF_Pos)                 /**< (TSENS_INTENSET) Overflow Interrupt Enable Mask */
#define TSENS_INTENSET_OVF(value)             (TSENS_INTENSET_OVF_Msk & ((value) << TSENS_INTENSET_OVF_Pos))
#define TSENS_INTENSET_Msk                    _U_(0x0F)                                            /**< (TSENS_INTENSET) Register Mask  */


/* -------- TSENS_INTFLAG : (TSENS Offset: 0x06) (R/W 8) Interrupt Flag Status and Clear Register -------- */
#define TSENS_INTFLAG_RESETVALUE              _U_(0x00)                                            /**<  (TSENS_INTFLAG) Interrupt Flag Status and Clear Register  Reset Value */

#define TSENS_INTFLAG_RESRDY_Pos              _U_(0)                                               /**< (TSENS_INTFLAG) Result Ready Position */
#define TSENS_INTFLAG_RESRDY_Msk              (_U_(0x1) << TSENS_INTFLAG_RESRDY_Pos)               /**< (TSENS_INTFLAG) Result Ready Mask */
#define TSENS_INTFLAG_RESRDY(value)           (TSENS_INTFLAG_RESRDY_Msk & ((value) << TSENS_INTFLAG_RESRDY_Pos))
#define TSENS_INTFLAG_OVERRUN_Pos             _U_(1)                                               /**< (TSENS_INTFLAG) Overrun Position */
#define TSENS_INTFLAG_OVERRUN_Msk             (_U_(0x1) << TSENS_INTFLAG_OVERRUN_Pos)              /**< (TSENS_INTFLAG) Overrun Mask */
#define TSENS_INTFLAG_OVERRUN(value)          (TSENS_INTFLAG_OVERRUN_Msk & ((value) << TSENS_INTFLAG_OVERRUN_Pos))
#define TSENS_INTFLAG_WINMON_Pos              _U_(2)                                               /**< (TSENS_INTFLAG) Window Monitor Position */
#define TSENS_INTFLAG_WINMON_Msk              (_U_(0x1) << TSENS_INTFLAG_WINMON_Pos)               /**< (TSENS_INTFLAG) Window Monitor Mask */
#define TSENS_INTFLAG_WINMON(value)           (TSENS_INTFLAG_WINMON_Msk & ((value) << TSENS_INTFLAG_WINMON_Pos))
#define TSENS_INTFLAG_OVF_Pos                 _U_(3)                                               /**< (TSENS_INTFLAG) Overflow Position */
#define TSENS_INTFLAG_OVF_Msk                 (_U_(0x1) << TSENS_INTFLAG_OVF_Pos)                  /**< (TSENS_INTFLAG) Overflow Mask */
#define TSENS_INTFLAG_OVF(value)              (TSENS_INTFLAG_OVF_Msk & ((value) << TSENS_INTFLAG_OVF_Pos))
#define TSENS_INTFLAG_Msk                     _U_(0x0F)                                            /**< (TSENS_INTFLAG) Register Mask  */


/* -------- TSENS_STATUS : (TSENS Offset: 0x07) ( R/ 8) Status Register -------- */
#define TSENS_STATUS_RESETVALUE               _U_(0x00)                                            /**<  (TSENS_STATUS) Status Register  Reset Value */

